# IsUnusedPhaseHidden Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleData..::..IsUnusedPhaseHidden Property
PanelScheduleData Class See Also
---
True if the user wishes to hide the unused phase column of a single phase panel, false otherwise.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public bool IsUnusedPhaseHidden { get; set; }
```

Visual Basic
---
```text
Public Property IsUnusedPhaseHidden As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsUnusedPhaseHidden {
	bool get ();
	void set (bool value);
}
```

# See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace